Revit 2024 API
BuiltInFailures.ComponentRepeaterFailures Class
 Failures related to component repeaters.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static class ComponentRepeaterFailures
Visual Basic
Public NotInheritable Class ComponentRepeaterFailures
Visual C++
public ref class ComponentRepeaterFailures abstract sealed
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.BuiltInFailures.ComponentRepeaterFailures
See Also
BuiltInFailures.ComponentRepeaterFailures Members
Autodesk.Revit.DB Namespace